app/Models/LoginModel.php

    public function getUserByEmail($email)
    {
        $email = trim(strtolower($email));

        // Conexão com o banco usando o CodeIgniter
        $db = Database::connect();
        if ($db->connect_error) {
            die('Erro ao conectar: ' . $db->connect_error); die;
        } else {
            $Conectado = 'Conexão bem-sucedida!';
            echo $Conectado;
            $builder = $db->table('logins');
            $builder->where('email', $email);
            $query = $builder->get();
---
SELECT *
FROM `logins`
WHERE `email` = 'admin@example.com'