app/Models/PessoaModel.php

SELECT *
FROM `pessoa`
WHERE `id` = '1'
---
    public function getUser($pessoa_id) {

        // Conexão com o banco usando o CodeIgniter
        $db = Database::connect();
        if ($db->connect_error) {
            die('Erro ao conectar: ' . $db->connect_error); die;
        } else {
            $Conectado = 'Conexão bem-sucedida!';
            echo $Conectado;
            $builder = $db->table('pessoa');
            $builder->where('id', $pessoa_id);
            $query = $builder->get();