app/Models/RoleModel.php

SELECT *
FROM `roles`
WHERE `id` = '1'
---
    public function getRole($role_id)
    {
        $db = Database::connect();
        if ($db->connect_error) {
            die('Erro ao conectar: ' . $db->connect_error); die;
        } else {
            $Conectado = 'Conexão bem-sucedida!';
            echo $Conectado;
            $builder = $db->table('roles');
            $builder->where('id', $role_id);
            $query = $builder->get();